# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# New way of working with Protocol Buffers
brew "buf"
# GNU compiler collection
brew "gcc"
# Remote repository management made easy
brew "ghq"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Like cURL, but for gRPC
brew "grpcurl"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Development kit for the Java programming language
brew "openjdk@21"
# Object-relational database system
brew "postgresql@18"
# Software environment for statistical computing
brew "r"
# User interface to the TELNET protocol
brew "telnet"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Application uninstaller
cask "appcleaner"
# Utility to create and modify archives
cask "betterzip"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Developer platform
cask "dotnet-sdk"
# Tool to measure the computer system's performance
cask "geekbench"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keep your computer awake
cask "jiggler"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-wallet"
# Scan and remove malware, spyware, and viruses
cask "malwarebytes"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Spreadsheet software
cask "microsoft-excel"
# Presentation software
cask "microsoft-powerpoint"
# Word processor
cask "microsoft-word"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Network protocol analyzer
cask "wireshark-app"
vscode "bierner.markdown-mermaid"
vscode "bmuskalla.vscode-tldr"
vscode "cweijan.vscode-database-client2"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "jakebecker.elixir-ls"
vscode "janisdd.vscode-edit-csv"
vscode "linhmtran168.mac-ca-vscode"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cpptools"
vscode "natqe.reload"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "vector-of-bool.gitflow"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "wayou.vscode-icons-mac"
vscode "zxh404.vscode-proto3"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/gopls"
go "github.com/vektra/mockery/v2"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/grpc-ecosystem/grpc-gateway/v2/protoc-gen-grpc-gateway"
go "github.com/grpc-ecosystem/grpc-gateway/v2/protoc-gen-openapiv2"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/cmd/swag"
