# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# New way of working with Protocol Buffers
brew "buf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Like cURL, but for gRPC
brew "grpcurl"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Development kit for the Java programming language
brew "openjdk"
# Object-relational database system
brew "postgresql@18"
# Software environment for statistical computing
brew "r"
# User interface to the TELNET protocol
brew "telnet"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Application uninstaller
cask "appcleaner"
# Utility to create and modify archives
cask "betterzip"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Developer platform
cask "dotnet-sdk"
# Web browser
cask "firefox"
# Tool to measure the computer system's performance
cask "geekbench"
# Web browser
cask "google-chrome"
# Keep your computer awake
cask "jiggler"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-wallet"
# Scan and remove malware, spyware, and viruses
cask "malwarebytes"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Presentation software
cask "microsoft-powerpoint"
# Word processor
cask "microsoft-word"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Network protocol analyzer
cask "wireshark-app"
